## [출석인정용과제]
property data.csv를 dataframe 형태로 읽어들여 df에 집어 넣고 OWN_OCCUPIED 열에 있는 NULL의 갯수를 출력하시오. 여기서 NULL은 pandas가 인식할 수 있는 Standard missing data를 의미함.

In [6]:
import pandas as pd
import numpy as np
df = pd.read_csv('property data.csv')
df['OWN_OCCUPIED'].isnull().sum()

1

## [학점취득용과제 1]

1. OWN_OCCUPIED 열을 출력하시오
1. OWN_OCCUPIED 열은 'Y' 또는 'N'값을 가져야 한다. 위에서 찾은 NULL값이 있는 자리를 'Y' 와 'N' 중에서 OWN_OCCUPIED 열에 더많이 나타나는 값으로 impute하고, impute한 결과가 보이도록 OWN_OCCUPIED 열을 출력하시오.  'Y' 와 'N' 중에서 OWN_OCCUPIED 열에 더많이 나타나는 값은 직접 주면 안되고 반드시 python coding을 통해 찾으시오.

In [7]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [10]:
a=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[a,'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    a+=1
N=df['OWN_OCCUPIED'].value_counts()['N']
Y=df['OWN_OCCUPIED'].value_counts()['Y']
df['OWN_OCCUPIED']=np.where(Y>N,df['OWN_OCCUPIED'].fillna('Y'),df['OWN_OCCUPIED'].fillna('N'))
df['OWN_OCCUPIED']

0    Y
1    N
2    N
3    Y
4    Y
5    Y
6    Y
7    Y
8    Y
Name: OWN_OCCUPIED, dtype: object

## [학점취득용과제 2]

1. 아래 dataframe에서 'two'열의 NULL값을 그 열의 평균값으로 impute 하고 전체 dataframe을 출력하시오
1. 그 후 NULL 값이 하나라도 있는 열을 모두 제거하고 출력하시오

In [11]:
import numpy as np

df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])
df = df.reindex(['a', 'b', 'c'])
print(df)

        one       two     three
a  0.426802  0.794216  0.590709
b       NaN       NaN       NaN
c -0.756248  0.288043 -0.343066

In [13]:
df.loc['b','two']=df['two'].mean()
df

        one       two     three
a  0.426802  0.794216  0.590709
b       NaN  0.541130       NaN
c -0.756248  0.288043 -0.343066

In [14]:
df.dropna(axis=1)

        two
a  0.794216
b  0.541130
c  0.288043